In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
Sales1 = Series([10000, np.nan, 20000, np.nan, 30000, np.nan],
               index=["East", "West", "North", "South", "NorthEast", "SouthEast"])
Sales1

East         10000.0
West             NaN
North        20000.0
South            NaN
NorthEast    30000.0
SouthEast        NaN
dtype: float64

In [3]:
Sales2 = Series([12000, 14000, 16000, 18000, 20000, 22000],
               index=["East", "West", "North", "South", "NorthEast", "SouthEast"])
Sales2

East         12000
West         14000
North        16000
South        18000
NorthEast    20000
SouthEast    22000
dtype: int64

In [4]:
Series(np.where(pd.isnull(Sales1), Sales2, Sales1), index=Sales1.index)

East         10000.0
West         14000.0
North        20000.0
South        18000.0
NorthEast    30000.0
SouthEast    22000.0
dtype: float64

In [5]:
Sales1.combine_first(Sales2)

East         10000.0
West         14000.0
North        20000.0
South        18000.0
NorthEast    30000.0
SouthEast    22000.0
dtype: float64

In [6]:
# Using combine in DataFrames

In [10]:
nan = np.nan
dframe_Sales1 = DataFrame({"East": [1500, nan, 3500, nan],
                          "West":[nan, 4500, nan, 5500],
                          "South":[6500, nan, 7500, nan]})
dframe_Sales1

     East    West   South
0  1500.0     NaN  6500.0
1     NaN  4500.0     NaN
2  3500.0     NaN  7500.0
3     NaN  5500.0     NaN

In [11]:
dframe_Sales2 = DataFrame({"East": [1200, 1300, nan, 1600, 1800],
                          "West": [nan, 5000, 6000, 7000, 8000]})
dframe_Sales2

     East    West
0  1200.0     NaN
1  1300.0  5000.0
2     NaN  6000.0
3  1600.0  7000.0
4  1800.0  8000.0

In [12]:
dframe_Sales1.combine_first(dframe_Sales2)

     East   South    West
0  1500.0  6500.0     NaN
1  1300.0     NaN  4500.0
2  3500.0  7500.0  6000.0
3  1600.0     NaN  5500.0
4  1800.0     NaN  8000.0